import os
from colors import C

def clear():
    os.system("cls" if os.name == "nt" else "clear")

def banner():
    print(C.C + r"""
.------------------------------------------------------------.
|     ______ __                    __                        |
|    / ____// /                   / /   ____   ____ _ _____  |
|   / /    / /        ______     / /   / __ \ / __ `// ___/  |
|  / /___ / /___     /_____/    / /___/ /_/ // /_/ /(__  )   |
|  \____//_____/               /_____/\____/ \__, //____/    |
|                                           /____/           |
'------------------------------------------------------------'  
""" + C.RESET)

def menu():
    clear()
    banner()
    print(C.Y + "1)" + C.W + " Запустить чтение лога в реальном времени.")
    print(C.Y + "2)" + C.W + " Проанализировать файл лога целиком.\n")
    print(C.Y + "3)" + C.W + " Выход.\n")

    return input(C.Y + "Выберите пункт: " + C.RESET)
